Examinator/src/Catalogs/СодержаниеЭлектронныхКурсов/СодержаниеЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеЭлектронныхКурсов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭлектронныеКурсы</owners>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеТесты</types>
      <types>CatalogRef.ТеорияЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипыЭлементовСодержанияЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Гиперссылки</name>
    <attributes>
      <name>Привязка</name>
      <type>
        <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресВДокументе</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыЭлементовСодержанияЭлектронногоКурса/ТипыЭлементовСодержанияЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовСодержанияЭлектронногоКурса</name>
  <enumValues>
    <name>Начало</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>Видео</name>
  </enumValues>
  <enumValues>
    <name>Звук</name>
  </enumValues>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>ДокументWord</name>
  </enumValues>
  <enumValues>
    <name>ДокументOpenOffice</name>
  </enumValues>
  <enumValues>
    <name>СлайдПрезентацииPowerPoint</name>
  </enumValues>
  <enumValues>
    <name>СлайдПрезентацииImpress</name>
  </enumValues>
  <enumValues>
    <name>ПрезентацияPowerPoint</name>
  </enumValues>
  <enumValues>
    <name>ПрезентацияImpress</name>
  </enumValues>
  <enumValues>
    <name>Глоссарий</name>
  </enumValues>
  <enumValues>
    <name>Финальный</name>
  </enumValues>
  <enumValues>
    <name>YouTube</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCO</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>PDF</name>
  </enumValues>
  <enumValues>
    <name>Картинка</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ИзучениеЭлектронногоКурса/ИзучениеЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзучениеЭлектронногоКурса</name>
  <registerRecords>InformationRegister.ИзученныеЭлектронныеКурсы</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаТестовыеВопросы</registerRecords>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>DefinedType.КонтекстЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>DefinedType.УчащийсяЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИзучения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоТестовоеИзучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестировщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПопыткиИзучения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПопытки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/СодержаниеЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ТипЭлементаПоСсылке(СсылкаНаЭлемент, ЭтоГруппа) Экспорт
	
	Если ЭтоГруппа Тогда		
		Возврат Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Группа;		
	Иначе		
		ВызватьИсключение НСтр("ru = 'Тип элемента содержания не определен'");		
	КонецЕсли;	
	
КонецФункции

Процедура УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(Знач ЭлементСодержания, Знач ПометкаУдаления, Знач ЭлектронныйКурс = Неопределено) Экспорт
	
	Если ЭлектронныйКурс = Неопределено Тогда
		ЭлектронныйКурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Владелец");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	
		// Подчиненные элементы
		
		ПодчиненныеЭлементы = РазработкаЭлектронныхКурсовСлужебный.ВсеСсылкиЭлементаСправочника(ЭлементСодержания, Истина,, Истина);
		
		Для каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
		
			Если ТипЗнч(ПодчиненныйЭлемент) = Тип("СправочникСсылка.ПоставщикиЭлектронныхКурсов") Тогда
				Продолжить; // Поставщика курса не удаляем
			КонецЕсли;			
			
			ПодчиненныйЭлементОбъект  = ПодчиненныйЭлемент.ПолучитьОбъект();
			ПодчиненныйЭлементОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
		
		КонецЦикла;		
		
		// Статистика изучения

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзучениеЭлектронногоКурса.Ссылка КАК Ссылка,
			|	ИзучениеЭлектронногоКурса.Учащийся КАК Учащийся
			|ИЗ
			|	Документ.ИзучениеЭлектронногоКурса КАК ИзучениеЭлектронногоКурса
			|ГДЕ
			|	ИзучениеЭлектронногоКурса.ЭлектронныйКурс = &ЭлектронныйКурс
			|	И ИзучениеЭлектронногоКурса.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Учащийся) Тогда
				Продолжить; // Для совместимости с 3.1, где были тестовые документы
			КонецЕсли;			
			ИзучениеЭлектронногоКурсаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
		
		
КонецПроцедуры

Функция НайтиПоСсылкеНаЭлемент(СсылкаНаЭлемент, ЭлектронныйКурс = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеЭлектронныхКурсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СодержаниеЭлектронныхКурсов КАК СодержаниеЭлектронныхКурсов
		|ГДЕ
		|	СодержаниеЭлектронныхКурсов.Элемент = &Элемент
		|	И &ОтборПоЭлектронномуКурсу
		|	И СодержаниеЭлектронныхКурсов.ЭтоГруппа = ЛОЖЬ
		|	И СодержаниеЭлектронныхКурсов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Элемент", СсылкаНаЭлемент);
	
	Если ЭлектронныйКурс = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЭлектронномуКурсу", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЭлектронномуКурсу", "СодержаниеЭлектронныхКурсов.Владелец = &ЭлектронныйКурс");
		Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ЭлементСодержания = Неопределено;
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда					
		ВыборкаДетальныеЗаписи.Следующий();
		ЭлементСодержания = ВыборкаДетальныеЗаписи.Ссылка;						
	КонецЕсли;
	
	Возврат ЭлементСодержания;
	
КонецФункции

Функция Гиперссылки(Знач ЭлементСодержания) Экспорт
	
	ВнутренниеГиперссылки = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеЭлектронныхКурсовГиперссылки.Привязка КАК Привязка,
		|	СодержаниеЭлектронныхКурсовГиперссылки.АдресВДокументе КАК АдресВДокументе
		|ИЗ
		|	Справочник.СодержаниеЭлектронныхКурсов.Гиперссылки КАК СодержаниеЭлектронныхКурсовГиперссылки
		|ГДЕ
		|	СодержаниеЭлектронныхКурсовГиперссылки.Ссылка = &ЭлементСодержания";
	
	Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВнутренниеГиперссылки.Вставить(ВыборкаДетальныеЗаписи.АдресВДокументе, ВыборкаДетальныеЗаписи.Привязка);
	КонецЦикла;
	
	Возврат ВнутренниеГиперссылки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
